# 081
# a, b, *c = (0, 1, 2, 3, 4, 5)
# print(a, b, c)
# scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# *valid_score, _, _ = scores
# print(valid_score)

# 082
# scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# _, _, *valid_score = scores
# print(valid_score)

# 083
# scores = [8.8, 8.9, 8.7, 9.2, 9.3, 9.7, 9.9, 9.5, 7.8, 9.4]
# _, *valid_score, _ = scores
# print(valid_score)

# 084
# temp = {}
# print(type(temp))

# 085
# 아이스크림 = {"메로나": 1000, "폴라포": 1200, "빵빠레": 1800}

# 086
# 아이스크림 = {"메로나": 1000, "폴라포": 1200, "빵빠레": 1800}
# 아이스크림['죠스바'] = 1200
# 아이스크림["월드콘"] = 1500
# print(아이스크림)

# 087
# ice = {'메로나': 1000,
#        '폴로포': 1200,
#        '빵빠레': 1800,
#        '죠스바': 1200,
#        '월드콘': 1500}
# print("메로나 가격:", ice["메로나"])

# 088
# ice = {'메로나': 1000,
#        '폴로포': 1200,
#        '빵빠레': 1800,
#        '죠스바': 1200,
#        '월드콘': 1500}
# ice["메로나"] = 1300
# print(ice)

# 089
# ice = {'메로나': 1000,
#        '폴로포': 1200,
#        '빵빠레': 1800,
#        '죠스바': 1200,
#        '월드콘': 1500}
# del ice["메로나"]
# print(ice)

# 090
icecream = {'폴라포': 1200, '빵빠레': 1800, '월드콘': 1500, '메로나': 1000}
icecream['누가바']
# 누가바가 없으니까
